[
    "There are 20,323,379 lines of code in the Linux kernel as of 2018. That might sound like a lot but it’s actually the smallest the kernel has been for some time! Even so, despite the recent reductions, the huge line count means Linux remains the single largest open source project on the planet.",
    "Linux is used by every major space program in the world including NASA and the ESA. Private space companies like SpaceX also leverage it, with the latter having completed 65 space missions (and counting) with the assistance of a fault-resistant Linux system in their powerful Falcon 9 rockets.",
    "Linux runs on everything, from smartphones and servers to submarines and space rockets.",
    "Steve Jobs offered Linus Torvalds a job in 2000, on the condition that he stopped development on Linux. Linus (thankfully) declined.",
    "Talking of contributions, Google, Intel, Huawei, Samsung, Red Hat, Canonical and Facebook are among the top contributors to Linux kernel development in recent years.",
    "Linus Torvalds was born in Finland, a bilingual country, and considers Swedish to be his “mother tongue”. He says he’s often “uncomfortable” speaking in English because of pronunciation differences, but prefers to read English books.",
    "Those breathtaking special effects you see in movie blockbusters? Well, they’re (partially) thanks to Linux. An estimated 90% of Hollywood visual effects rely on Linux at some stage in the production pipeline.",
    "Bizarre though it may sound 13.3% of the latest Linux kernel is made up of …blank lines. Pointless?\nHardly: blank lines are part of the strict coding style that keeps the kernel tidy, efficient and ordered.",
    "The first book to be published about Linux was Matt Welsh’s ‘Linux Installation and Getting Started’ back in 1993. The first dedicated magazine, Linux Journal, was published a year later in March 1994.",
    "Linux is the most famous example of open source software but did you know that it wasn’t always that way? Early versions of Linux was distributed with a license forbidding commercial use or redistribution. It was version 0.12, released in 1992, that saw Linus adopt the GPL, making his code freely available to all.",
    "Linux isn't very useful alone, so folks took to creating Linux distributions to bundle user software with it, make it usable and easier to install. One of the first Linux distributions was Softlanding Linux System (SLS), first released in 1992 and using the .96p4 Linux kernel. ",
    "SLS didn't last, but it influenced Slackware Linux, which was first released in 1993 and is still under development today. Slackware is the oldest surviving Linux distribution.",
    "Linux has the largest install base of any general purpose operating system. It powers everything from all 500 of the Top 500 Supercomputers to Android phones, Chromebooks, and all manner of embedded devices and things like the Kindle eBook readers and smart televisions. (Also the laptop used to write this post.)",
    "When Linus announced Linux, he didn't actually announce Linux. It was not yet named, he just said \"a free operating system\" and that it resembled Minix. Somewhat. Later the name for Linux was going to be \"Freax,\" a combination of \"free\", \"freak\", and \"x.\"",
    "Once it had a name, then people had to figure out how to pronounce it. Linus himself provided a sound file pronouncing Linux, and it's pronounced (roughly) Leenucks.",
    "It's put on a bit of weight since 1991. The first Linux release weighed in less than 1MB in size, uncompressed. The most recent stable kernel (5.2.7 as of this writing) weighs in at about 103MB compressed, 946MB uncompressed. To be fair, it does a lot more now than it did in 1991.",
    "You may notice that there's a lot of choice when it comes to Linux. A lot of choice. According to the site Distrowatch, there have been more than 850 Linux distributions registered with the site. Many of which have fallen by the wayside over the years. ",
    "When you boot up your computer, Linux isn't the first thing that runs. It depends on a bootloader to kick things off and then hand things over to the operating system to load device drivers and take over operation. Things were not always as simple as using a USB stick or CD-ROM to boot the system you wanted to run Linux on, either.",
    "The Linux kernel used to have a versioning system of even numbered releases for stable kernels, and odd numbered releases for development kernels. For example, the 2.2 Linux kernel series was a \"stable\" kernel series, 2.3 was unstable. That changed with the 2.6 kernel, when they began trying to release new kernels faster and stopped with long development cycles.",
    "Linux wasn't originally written to be portable. Linus targeted the 386 and that was it. The first \"official\" port was to DEC Alpha CPUs in 1995. The Linux kernel now runs on a large number of CPUs, though support for the 386 itself was dropped in 2012.",
    "Linux has thousands of contributors. In 2016 the Linux Foundation identified 13,594 contributors between 2005 and 2016, and counted more than 22 million lines of code in the kernel. That doesn't take into account the contributors before tracking began in 2005. ",
    "Most Linux enthusiasts have heard of the kernel's official mascot, Tux. What many folks don't know is that Tux had an official break during the 2.6.29 kernel cycle and was replaced by Tuz.",
    "One of the first, if not the first, successful worms targeting Linux reared its head in January 2001. The Ramen Worm targeted wu-ftpd, nfs-utils, and lprng and served as a heads up that as Linux gained popularity it was going to see its share of attempts to create worms, viruses, and other exploits specifically against Linux.",
    "The New York Stock Exchange (NYSE) converted to using Linux for mission-critical systems in 2007. ",
    "Without Linux there'd probably be no Git, either. Linus Torvalds created Git to use for development of the Linux kernel, because he wasn't happy with existing version control systems. So, Linux isn't just responsible for a huge ecosystem around the operating system, it also has laid at the heart of what's currently the most popular social development platform in use today. ",
    "Once upon a time, Apple sponsored a project to run Linux on the Mach microkernel, on top of Apple's Power Macintosh platforms. It seems to have been Apple's first foray into open source, officially, ahead of Darwin which was announced in 1999. ",
    "Before Google existed, finding things on the Internet was a bit more of a challenge. In 1998 a few enterprising Linux enthusiasts put together a \"Linux Search Engine\" to help users find information on Linux distributions, Linux User Groups, and other things Linux-related. Sadly, the contents of the search engine (more accurately, a directory) have been lost to the mists of time and bitrot.",
    "Installing Linux hasn't always been easy. But it is occasionally entertaining.  Back when disks were slow and installers asked a lot of questions, the Caldera OpenLinux installer featured a Tetris-type game you could play while it was copied to your drive. ",
    "It's common knowledge that Linux is used a lot in film production these days. If you're seeing a movie with a lot of CGI, there's a good chance that the rendering for that movie was done on Linux. The first major movie to use Linux, at least publicly, was Titanic.",
    "The rate of Linux development remains unmatched – Linux kernel 3.15 had the busiest development cycle in the kernel’s history. On average, 7.71 kernel code changes are submitted per hour – that translates to 185 changes every day and nearly 1,300 per week.",
    "Linux users don’t usually have “root” privileges, but lower-level accounts. This means that even if a Linux system is compromised, the virus doesn’t have root access to do system wide damage; more likely, only the user’s local files and programs would be affected.",
    "According to openhub.net, the majority (95%) of Linux is written in C language. The second popular language for Linux is assembly language (2.8%).",
    "A Linux \"distribution\" contains the Linux kernel, supporting GNU utilities/libraries, and other third-party applications. According to distrowatch.com, there are a total of 286 actively maintained Linux distrutions. The oldest among them is Slackware whose very first release 1.0 became available in 1993.",
    "Kernel.org, which is the main repository of Linux source code, was compromised by an unknown attacker in August, 2011, who managed to tamper with several kernel.org's servers. In an effort to tighten up access policies of the Linux kernel, Linux foundation recently turned on two-factor authentication at the official Git repositories hosting the Linux kernel.",
    "In the modern history of Linux kernel development, there was a big jump in kernel version: from 2.6 to 3.0. The renumbering to version 3 actually did not signify any major restructuring in kernel code, but was simply to celebrate the 20 year milestone of the Linux kernel.",
    "The reboot() system call in the Linux kernel requires two magic numbers. The second magic number comes from the birth dates of Linus Torvalds and his three daughters.",
    "As his favorite text editor, Linus uses something called uEmacs/PK, which is a customized version of MicroEMACS, a lightweight Emacs-like editor.",
    "In 2003, there was an attempt to insert a backdoor in the Linux kernel source hosted in a CVS repository which apparently had been broken into. Disguised as an innocuous error checking routine, the backdoor was designed to obtain root privileges under specific conditions. This backdoor never made it to the mainline kernel, and was caught by kernel maintainers.",
    "Linus Torvalds is well known for having very strong opinions about many things related to Linux, and does not mind using harsh or even abusive language to get his message across.",
    "With so many fans of Linux around the world, there are criticisms on current Linux distributions (mainly desktops), such as limited hardware support, lack of standardization, instability due to short upgrade/release cycles, etc. During the Linux kernel panel at LinuxCon 2014, Linus was quoted as saying \"I still want the desktop\" when asked where he thinks Linux should go next.",
    "Linux kernels have weird and funny code names. For example, the code name for the latest kernel 4.0 is \"Hurr durr I'ma sheep.\" These code names are authored by Linus Torvalds himself, and included in the Makefile of their source trees.",
    "You can run Microsoft Windows and the Linux kernel side by side on the same computer using a software called Cooperative Linux (coLinux).",
    "Linux is favored by the tech giants as well. For the web and cloud services, Linux is the first choice for Google, Amazon and Facebook.",
    "The bullet trains in Japan use Linux to maintain and manage the sophisticated Automatic Train Control system. Also, the In-Vehicle-Infotainment technology (IVI) inside Toyota and other automobiles use Linux platform.",
    "The Linux kernel has expanded exponentially since it was first put out in the open source category. Today, Linus Torvalds’s codes account for only about 2% of the total codes in the kernel.",
    "Wonder why the basic language taught in the schools is C? Because, a major chunk of the operating system kernels including Windows, Linux and Mac are written in C language. So, if you plan on becoming a developer, know the basics.",
    "Linus Torvalds went on a self-exile in his bedroom for fulfilling his hobby. His exile period took a few weeks of the year 1991 when he could come out with few lines of codes. His 10,250 lines of codes became a new category of the central part of an OS and now dominating the world.",
    "In the year 1996, the founder announced that there would be a mascot for his creation. He made the Tux as the mascot, which is a penguin. There is a story about the penguin that Torvalds once got a bite by an angry penguin, which caused disease. Some also say that one baby penguin chewed him. However, the name Tux was a proposal by James Hughes. ",
    "Out of many, Ubuntu, which is a Linux based operating system, is the most used and popular one from the Linux family. It has reached up to 20M people around the world. And this number is gradually increasing at a high rate. Besides Ubuntu, There are some other distros that have gained immense popularity like Elementary OS, Linux Mint and interesting fact is that all of them are based on Ubuntu Linux.",
    "In the year 2000, the Linux Foundation started its journey. It was formed to create an ecosystem that maintains the standard of the source codes. It also promotes the kernel for commercial adoption that ultimately helps its spreading across the platform. This dedicated organization is a non-profit organization.",
    "Each time a kernel is released, it receives a code name. These names are interesting. Affluent Albatross, Sliding Snow Leopard, Stable Penguin, Wet Seal, Suicidal Squirrel, TOSSUG Baby Fish, etc. are some examples of the code names of different versions of kernels released at different times.",
    "At the tail end of the last century and beginning of this century, the popular and tech giant Windows was against Linux and tried a lot to diminish Linux. Very, fortunately, Windows is now using its own money for the development of the kernel. Windows has reason to contribute as they are now using the kernel for their server.",
    "The dominating kernel is super fast in its update process. You can expect the release of a new version after eight weeks from any release. So, new things are happening with the kernel within a short time. Now people do not have to wait for a long time for any problem issue. Ubuntu, one of the most popular distros of Linux, has a stringent rule of releasing a new version within six months.",
    "The founder of Apple, once in 2000, wanted to make Linus one of the employees of his company by offering him a job. Steve Jobs had a better plan to use Linus in apple to make it a better one. However, Linus fortunately denied, and that decision made him a competitor of Steve Jobs.",
    "Linus had to use an OS to build his creation. So he had to use MINIX as the OS, which acted as the first workshop for Linux. In that time, he used ext, which is a common and known file system for us. Initially, he tried with the same system which MINIX had. However, that did not help him.",
    "The trademark was not easy to get, and Torvalds had to take huge pain to make Linux a trademark. William R. Della was the man who initiated the fight to get the trademark on 15 Aug 1994. However, it came into reality after more than three years. This has taken Linux into a new level.",
    "No, washing machines are not using Linux kernel to wash clothes. In Switzerland, there is a company of washing powder named the same as the kernel created by Linus. This is a famous washing powder brand that produces not only washing powder but also liquid detergent, laundry care, washing-up liquid, dishwasher, etc.",
    "Linux has given birth to many distributions. Among them, Red Hat is very popular and widely used, and Red Hat uses the Linux kernel to make its distribution like RHEL, Fedora Linux, Scientific Linux, etc. This company is the first company that has become a billionaire among open source companies.",
    "Linux was once termed as ‘cancer’ by the former Microsoft CEO Steve Ballmer. However, this man no longer thinks his comment is valid till now. Instead, he expressed that he loves Linux. The most exciting thing is that Microsoft has its distribution using the Linux kernel.",
    "Linus once refused to do a job that was offered by the founder of apple. We know that was one of his best decisions. That was not the only time he refused someone’s request. He has also rejected the job offer of the NSA of America. He was told to create a backdoor in his kernel, which he declined.",
    "The founder of Linux, Linus Torvalds, is honored with $10 million in a year, which is provided by the Linux Foundation so that he continues his contribution to his creation. The amount may look big or small, that does not matter; the position he got in the heart of people is incomparable. That place is worth more than $10 Million.",
    "Sometimes people get sudden success like Linus, who created such a thing that took him to the vertex. There are other successful people like Bill Gates and Steve Jobs, who also got success. These two legends stopped their college so that they can pursue their careers without any other interference. However, Linus’ success did not stop him from learning, and thus, he did not leave college even after getting huge success. He tried his best and earned a master’s in Computer Science.",
    "The acceptance level of Linux is too high, which receives nearly 200 patches in a single day. This made Linux the most active open source project in the world. Again, it has got a vast development body, which keeps it always busy, unlike other open source projects.",
    "Many renowned banks around the world have shifted to the Linux system. Some of them are on the way to do so. And all the banks will change to the system soon. This has happened as Linux provides a more stable and secure environment to the users. And security is a paramount issue for the banks.",
    "Some of the important things are kept within the kernel as code form, which represents some information about Linus. The arguments which are required for the reboot system need some numbers called ‘Magic Numbers.’ Like 672274793, which becomes  0x28121969 after hex conversion. So it comes on 28th December 1969, which is the birthday of Linus. In the say way, more magic numbers show some dates after the conversion. His daughter’s birthday is also found in another name.",
    "No, it is not obsolete. But, once, a writer of a famous book on networking and OS has commented that the kernel was outdated. The name of this gentleman is Andrew Stuart Tanenbaum, who was a scientist and professor of computer science. However, he is the author of MINIX, which was used initially by Linus.",
    "Microsoft was not very much impressed by its open source systems and criticized it badly but later it was sponsored by Microsoft itself.",
    "Linux is very late that it released after three years of it's announced date.",
    "All major closed source Operating Systems track user information while Linux distros generally don't, which means better user Security and Privacy is assured.",
    "Android and Chrome OS are Linux derivatives.",
    "Many computer games are written on Linux, then ported to Windows, Mac or whatever console they are going to.",
    "While you can do this with any OS if you know how, most Linux distros come in a \"Live Disk\", which means you can run the OS from the DVD/CD, or even a jumpdrive, without installing anything. Want to try that Ubuntu or Kali? Download, burn to disk, stick it in your DVD drive and restart. It will ask if you want to install or just play with it.",
    "You generally don't need an antivirus on Linux. It's not that it's perfectly virus free, however, it does make viruses work harder to infect your machine. That, and virus programmers usually pick on the most popular OS's, like Windows and Mac.",
    "Lots of your favorite Windows programs will work in Linux using WINE, a program that allows the use with Windows programs. But the Linux community also enjoys creating clones that work natively in Linux. They're not always perfect, but some are downright polished, like Libre Office (an office suite compatible with MS Office documents).",
    "If you'd like to continue using Windows, but still want to install Linux, you can do the two side by side. Many Linux installs will ask if you want to load besides Windows. After install, you get to choose which one you want.",
    "Every release of Linux kernels is given some funky codenames. For example, v5.12.19 is named “Frozen Wasteland,” v4.3.6 is named “Blurry Fish Butt,” v3.7.0 is named “Terrified Chipmunk,” and so on.",
    "The GitHub repository for Linux has more than 117k stars and more than 700+ releases to date.",
    "Linux is not an OS, but it is the kernel, GNU Linux is the OS and it comes in several hundred flavours.",
    "For those who think Linux can’t do Animation – Oscar-winning visual effects of the Titanic by James Cameron came from machines with Linux and Avatar was the last movie completely developed in 3D Applications on Linux platform using Foss Software. Exclaimed!",
    "Believe it or not – In 2002, Microsoft had accumulated a $421 million cost of fighting the spread of Linux, according to The Register.",
    "According to a study funded by the European Union, the estimated cost to redevelop the most recent kernel versions would be at $1.14 billion USD – Amazed.",
    "Android mascot was stolen! Google didn’t originally create that mascot. The mascot was adopted from a character named Android! from a game called Gauntlet.",
    "Of the Linux kernel git population, 9% are women",
    "Systemd now has nearly 1.3 million lines of code",
    "The countries that use Linux the most are India, Russia, and Cuba",
    "83.1% of developers claim that they prefer to work on Linux as opposed to other operating systems",
    "If This Message Shows up, this is just an annual test to ensure the funfact.service is working!! It is working",
    "Linux very nearly wasn’t called Linux!\nLinus wanted to call his “hobby” project “FreaX” (a combination of “free”, “freak” and “Unix”). Thankfully, he was persuaded otherwise by the owner of the server hosting his early code, who happened to prefer the name “Linux” (a combination of “Linus” and “Unix”).",
    "Though Linus wrote 100% of the first Linux release less than 1% of the latest kernel release includes code written by him. He ain't slacking off, he just merges (and manages) code from other developers.",
    "There are actual asteroids in actual space named after Linux and Linus Torvalds — whether space geek or tech geek, it seems we geeks like to stick together!",
    "Have you ever wondered why it’s logo is a penguin? The answer depends on who you ask:\nLinus recounts a story in which he was bitten by an angry penguin, infecting him with a (made-up) disease called “penguinitis”. Others say its selection was due to Linus’ fondness for the animal and/or its unsuitability as a corporate logo.",
    "Linux isn’t Linus Torvalds’ only celebrated creation. The famous Finn is also responsible for the Git versioning system and the scuba diving app ‘Subsurface’.",
    "As of 2018 100% of the worlds 500 fastest supercomputers run Linux. Impressive!",
    "Federal regulations prohibit the use of captioned telephone services by people who don't have a hearing loss that necessitates"
]
