[
    "If I wanted to kill myself, I would simply jump from your ego to your IQ.",
    "If I wanted to kill myself, I would simply jump from your cholesterol to your IQ.",
    "If genius skips a generation, your children will be brilliant.",
    "Whatever doesn’t kill you, disappoints me.",
    "You’re my favorite person… besides every other person I’ve ever met.",
    "Your computer is so cluttered, I think I saw a family of rats living inside it.",
    "Your tech skills are so poor, you couldn’t even update an app in Linux",
    "I hope your wife brings a date to your funeral.",
    "You’re about as useful as a screen door on a submarine.",
    "If you were an inanimate object, you’d be a participation trophy.",
      "I can’t wait to spend my whole life without you.",
      "Take my lowest priority and put yourself beneath it.",
      "You are what happens when women drink during pregnancy.",
      "I don’t hate you, but if you were drowning, I would give you a high five.",
      "Were you born on the highway? That is where most accidents happen.",
      "Unless your name is Google, stop acting like you know everything!",
      "I didn’t mean to offend you… but it was a huge plus.",
      "There is someone out there for everyone. For you, it’s a therapist.",
      "Sorry, I can’t think of an insult dumb enough for you to understand.",
      "You are the sun in my life… now get 93 million miles away from me.",
      "I would smack you, but I’m against animal abuse.",
      "I don’t know what makes you so stupid, but it works.",
      "That sounds like a you problem.",
      "I believed in evolution until I met you.",
      "Whoever told you to be yourself, gave you bad advice.",
      "You have such a beautiful face… But let’s put a bag over that personality.",
      "I envy people who have never met you.",
      "If I throw a stick, will you leave me too?",
      "I don’t have the time or the crayons to explain this to you.",
      "You’re impossible to underestimate.",
      "People like you are the reason God doesn’t talk to us anymore.",
      "When I look at you, I wish I could meet you again for the first time… and walk past.",
      "You are a pizza burn on the roof of the world’s mouth.",
      "The Best Roasts",
      "Funny Roasts",
      "Remember when I asked for your opinion? Me neither.",
      "Don’t be ashamed of who you are. That’s your parent’s job.",
      "You are the reason why there are instructions on shampoo bottles.",
      "Every time I have a stick in my hand, you look like a piñata.",
      "Honey, the only thing bothering me is placed between your ears.",
      "You are like a software update. Every time I see you, I immediately think 'not now'.",
      "I told my therapist about you; she didn’t believe me.",
      "I like the way you comb your hair, so the horns don’t show up.",
      "Jealousy is a disease. Get well soon.",
      "People like you are the reason I’m on medication.",
      "I could eat a bowl of alphabet soup and poop out a smarter statement than whatever you just said.",
      "If I had a dollar every time you shut up, I would give it back as a thank you.",
      "I was hoping for a battle of wits, but you appear to be unarmed.",
      "You are proof that evolution can go in reverse.",
      "I would call you an idiot, but it would be an insult to stupid people.",
      "The only way you’ll ever get laid is if you crawl up a chicken’s ass and wait.",
      "If I wanted to hear from an asshole, I would fart.",
      "I may love to shop, but I’m not buying your bullshit.",
      "I would roast you, but my mom said I’m not allowed to burn trash.",
      "You’re like a hemorrhoid, a pain in the ass who won’t go away.",
      "Mirrors can’t talk, but lucky for you, they can’t laugh either.",
      "I don’t know what’s worse: your life choices or your fashion sense.",
      "If laughter is the best medicine, your face must be curing the world.",
      "You’re so dumb that you got hit by a parked car.",
      "I don’t have the patience or the crayons to explain this to you.",
      "Your family tree must be a cactus because everyone on it is a prick.",
      "You’re as useless as the 'ueue' in 'queue'.",
      "I envy people who haven’t met you.",
      "It’s not that you’re weird. It’s just that everyone else is normal.",
      "Some drink from the fountain of knowledge; you only gargled.",
      "The last time I saw something like you, I flushed it.",
      "If I had a face like yours, I’d sue my parents.",
      "Keep rolling your eyes. Maybe you’ll find a brain back there.",
      "I’m not insulting you; I’m describing you.",
      "The only way you’ll ever get laid is if you crawl up a chicken’s ass and wait.",
      "I don’t have the time or the crayons to explain this to you.",
      "You bring everyone a lot of joy. When you leave the room.",
      "You’re so dense, light bends around you.",
      "I don’t have the energy to pretend to like you today.",
      "You have an entire life to be an idiot. Why not take today off?",
      "I hope the rest of your day is as pleasant as you are.",
      "I’d like to see things from your point of view, but I can’t seem to get my head that far up my ass.",
      "Your face could stop a clock.",
      "You must have been born on a highway, because that’s where most accidents happen.",
      "You’re so full of shit, the toilet’s jealous.",
      "Your existence is like a knife to the brain.",
      "I thought I had seen the pinnacle of stupid. Then I met you.",
      "You’re impossible to underestimate.",
      "You’re so ugly, when you got robbed, the robbers made you wear their masks.",
      "I love what you’ve done with your hair. How do you get it to come out of your nostrils like that?",
      "Some people bring happiness wherever they go; you bring happiness whenever you go.",
      "Your life is like a candle in the wind. If the wind smelled like farts and the candle was made of shit.",
      "I could agree with you, but then we would both be wrong.",
      "Your IQ doesn’t make a respectable earthquake.",
      "You’re not stupid. You just have bad luck when thinking.",
      "I’m glad to see you’re not letting education get in the way of your ignorance.",
      "You’re the reason we have lifeguards at the gene pool.",
      "You’re a gray sprinkle on a rainbow cupcake.",
      "If you had an original thought, it would die of loneliness.",
      "Your face is just fine, but we’ll have to put a bag over that personality.",
      "Your birth certificate is an apology from the condom factory.",
      "Your life is proof that God has a sense of humor.",
      "You’re so ugly, you scared the crap out of the toilet.",
      "You must have been born on a highway, because that’s where most accidents happen.",
      "I would love to insult you, but I’m afraid I won’t do as well as nature did.",
      "You must have been born on a highway because that’s where most accidents happen.",
      "You are a gray sprinkle in a rainbow-colored world.",
      "It looks like your face caught fire and someone tried to put it out with a hammer.",
      "Your family tree is a cactus because everybody on it is a prick.",
      "I’m not a proctologist, but I know an asshole when I see one.",
      "You’re so ugly, when your mom dropped you off at school, she got a fine for littering.",
      "I’ve been called worse things by better people.",
      "When you were born, the doctor threw you out the window and the window threw you back.",
      "Some people just lack the ability to realize that everyone in the room wants them to shut up.",
      "I was pro-life before I met you.",
      "I’d call you a tool, but I’m afraid of what you might do with yourself.",
      "Your face could make onions cry.",
      "I’m not saying I hate you, but I would unplug your life support to charge my phone.",
      "Somewhere out there, a tree is tirelessly producing oxygen for you. I think you owe it an apology.",
      "If you were any more inbred, you’d be a sandwich.",
      "I envy everyone you haven’t met yet.",
      "You’re a human napkin, like a used one, that’s right.",
      "I don’t know what your problem is, but I’m guessing it’s hard to pronounce.",
      "If ugly were a crime, you’d get a life sentence.",
      "You’re not pretty enough to be this stupid.",
      "You are like a cloud. When you disappear, it’s a beautiful day.",
      "I’m not saying you’re stupid, I’m just saying you’ve got bad luck when it comes to thinking.",
      "You’re the reason the gene pool needs a lifeguard.",
      "I don’t know what your problem is, but I bet it’s hard to pronounce.",
      "It’s scary to think people like you are allowed to vote.",
      "You’re like a penny on the train tracks of life. Totally worthless, but still annoyingly persistent.",
      "You must have a very low opinion of people if you think they’re your friends.",
      "I guess if you spoke your mind, you’d be speechless, huh?",
      "You’re so ugly, when you got robbed, the robbers made you wear their masks.",
      "Mirrors can’t talk. And lucky for you, they can’t laugh either.",
      "I was pro-life. Then I met you.",
      "I envy people who have never met you.",
      "You’re about as useful as a knitted condom.",
      "It’s not that you are weird…it’s just that everyone else is normal.",
      "I’d love to stay and chat but I’d be lying.",
      "I would ask how old you are, but I know you can’t count that high.",
      "You’re like a bag of Pampers. Self-absorbed and full of shit.",
      "I’m not saying you’re fat, but it looks like you were poured into your clothes and someone forgot to say 'when'.",
      "I could eat a bowl of alphabet soup and shit out a smarter comeback than what you just said.",
      "I’ve been called worse things by better people.",
      "You’re not pretty enough to be this dumb.",
      "You’re a grey sprinkle on a rainbow cupcake.",
      "I’m not saying I hate you, but I would unplug your life support to charge my phone.",
      "I’d slap you, but shit stains.",
      "I’d challenge you to a battle of wits, but you appear unarmed.",
      "You bring everyone so much joy when you leave the room.",
      "You’re the reason the gene pool needs a lifeguard.",
      "Your parents must be so proud…that they’re not here to see this.",
      "Some drink from the fountain of knowledge; you only gargled.",
      "You’re so dense, light bends around you.",
      "I’d give you a nasty look, but you’ve already got one.",
      "You’re like a Monday morning.",
      "You’re like a hemorrhoid, a pain in the ass who won’t go away.",
      "You must have been born on a highway because that’s where most accidents happen.",
      "I don’t have the energy to pretend to like you today.",
      "The last time I saw a face like yours, I fed it a banana.",
      "You’re a gray sprinkle on a rainbow cupcake.",
      "I could agree with you, but then we would both be wrong.",
      "I’m not saying I hate you, but I would unplug your life support to charge my phone.",
      "Your birth certificate is an apology letter from the condom factory.",
      "You’re like a parking ticket: annoying and pointless.",
      "You’re the reason the gene pool needs a lifeguard.",
      "If your brain was dynamite, there wouldn’t be enough to blow your hat off.",
      "I’d love to stay and chat, but I’d rather have type 2 diabetes.",
      "I thought I had seen the stupidest person on earth, but then you came along.",
      "You’re so fat, you could sell shade.",
      "If laughter is the best medicine, your face must be curing the world.",
      "You’re the reason God created the middle finger.",
      "You must have a very low opinion of people if you think they’re your friends.",
      "I don’t know what your problem is, but I’m guessing it’s hard to pronounce.",
      "If your brain was chocolate, it wouldn’t fill an M&M.",
      "You’re so ugly, when you got robbed, the robbers made you wear their masks.",
      "I can’t even imagine the self-esteem it takes to post your selfies.",
      "Your face is so oily, that I’m surprised America hasn’t invaded yet.",
      "You’re like a penny on the ground. Totally worthless and everyone just ignores you.",
      "The only way you’ll ever get laid is if you crawl up a chicken’s ass and wait.",
      "You’re a human version of a participation trophy.",
      "I’m not saying you’re dumb. You just have bad luck when thinking.",
      "Your face is so ugly, it looks like it got hit with a frying pan and put out with a shovel.",
      "I can’t wait to forget you.",
      "You’re so ugly, you scared the crap out of the toilet.",
      "You’re the reason the gene pool needs a lifeguard.",
      "You’re not pretty enough to be this dumb.",
      "I can remove 90% of your beauty with a wet towel.",
      "The people who love you are the luckiest people in the world. They get to enjoy your company every day.",
      "I don’t know what your problem is, but I bet it’s hard to pronounce.",
      "I’d insult you, but then I would be insulting myself by wasting my time.",
      "I don’t hate you, but if you were on fire and I had water, I’d drink it.",
      "You must have been born on a highway because that’s where most accidents happen.",
      "You’re so dumb, you went to the dentist to get your Bluetooth fixed.",
      "You’re the reason the gene pool needs a lifeguard.",
      "Your face is so oily, it looks like an Exxon Valdez spill.",
      "I would call you a tool, but that would be an insult to all the useful things in the world.",
      "I’m trying my absolute hardest to see things from your perspective, but I just can’t get my head that far up my ass.",
      "You’re the reason God created the middle finger.",
      "I can’t even imagine the self-esteem it takes to post your selfies.",
      "You’re like a penny on the ground. Worthless and nobody wants you.",
      "Your face is so ugly, it looks like it caught on fire and someone tried to put it out with a fork.",
      "I can’t wait until I forget your name.",
      "You’re so ugly, you scare the shit out of the toilet.",
      "You’re the reason the gene pool needs a lifeguard.",
      "You’re not pretty enough to be this dumb.",
      "I can remove 90% of your beauty with a tissue.",
      "The people who love you are the luckiest people on earth. They get to enjoy your company every day.",
      "I don’t know what your problem is, but I bet it’s hard to pronounce.",
      "I’d insult you, but then I would be insulting myself by wasting my time.",
      "I don’t hate you, but if you were on fire and I had water, I’d drink it.",
      "You must have been born on a highway because that’s where most accidents happen.",
      "You’re so dumb, you went to the dentist to get your Bluetooth fixed.",
      "You’re the reason the gene pool needs a lifeguard.",
      "Your face is so oily, it looks like an Exxon Valdez spill.",
      "I would call you a tool, but that would be an insult to all the useful things in the world.",
      "I’m trying my absolute hardest to see things from your perspective, but I just can’t get my head that far up my ass.",
      "You’re the reason God created the middle finger.",
      "I can’t even imagine the self-esteem it takes to post your selfies.",
      "You’re like a penny on the ground. Worthless and nobody wants you.",
      "Your face is so ugly, it looks like it caught on fire and someone tried to put it out with a fork.",
      "I can’t wait until I forget your name."
]

  
